import {configureStore} from "@reduxjs/toolkit";
import {userSlice} from "./slices/userSlice/userSlice.ts";

//2. Створюєм сховище за допомоги спеціальної функції configureStore() в середину передаємо опції
// з чого воно буде складатися

export const  store= configureStore({

    //існує параметер в якому будуть частинки сховища тобто у нас є сторінки і їх потрібно розділити кімнати
    // для певних стрінок сутностей і всієї роботи з ними назва їх в редакті тукета слайси/Тобто є функція яка
    // приймає опції за допомоги цих опоцій породжується сховище

    reducer:{
        userSlice:userSlice.reducer,// потрібно сформувати слайс,і тут пишем його функцію
        // postSlice:null

    }

});
