//створюємо сховище в межах якого між собою компоненти зможуть один з одним ділитися інформацією
import {createContext} from "react";

//тут буде кнопка з лічильником яка буде міняти інформацію в зовсім іншому компоненті
type MyContextType={
    counterValue:number,
    increment:(obj:number)=>void,//функція яка нічого не повертає просто модель
};

export const init = {
    // typescript і зараз -описуємо тут і в іншому місці
    counterValue:0,
    increment:()=>{

    },
};

// функція повинна бути типізована і вній повиний бути об'єкт дефолтний
export const MyContext = createContext<MyContextType>(init);//1=викликала функцію
// яка створює сховище для наших об'єктів..2=MyContextType=вказали який тип даних буде лежати в середині..
// 3=init= вказали йому дефолтне значення
