//створюємо сховище який буде характеризувати цей MyContext.
//Контекст в межах якого між собою компоненти зможуть ділитися інформацією
//1.повина бути функція і вона повинна бути типізована і в неї повинно бути об'єкт дефолтний
// = вона відпрацює і створить об'єкт MyContext

import {createContext} from "react";
//лічильник = буде кнопка в якомусь глибокому компоненті, яка буде змінювати інформацію в зовсім іншому
// компоненті на тому самому або на іншому рівні

 type MyContextType={
     //лічильник
     counterValue: number;
     // функция буде приймати об'єкт числовий і збільшувати на 1 і нічого не повертатиме
     increment: (object:number)=>void;
 };

 //можна винести окреме значення не описувати в середині=обє'кт з дефолтними значеннями-ініціалізатор такий своєрідний
export const init = {
    counterValue:0,
    // робити нічого не буде бо дефолтне значення в джава ми не описували ставили нал і описували в іншому місті,
    // а в тайпскріпті і тут і в іншому місці визначити
    increment: (object:number)=>{
        console.log(object);
    },
}; // для чого ставим на експорт


//тобто викликали ф-ю яка створює сховище для наших об'єктів createContext,сказали який тип даних
// в середині MyContextType, і зробили йому дефолтне значення init
export const MyContext = createContext<MyContextType>(init);
